<?php

use Illuminate\Database\Seeder;


class RemsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
    	

           $RasArr = array (array(733,  7,	'Хмельникский  РЭС/ВЦПЭС'),
							array(732,  7,	'Шаргородский  РЭС/ВЦПЭС'),
							array(734,  7,	'Замостянский  РЭС/ВЦПЭС'),
							array(735,  7,	'Черневецкий   РЭС/ВЦПЭС'),
							array(723,  7,	'Барский       РЭС/ВЦПЭС'),
							array(731,  7,	'Тывровский    РЭС/ВЦПЭС'),
							array(722,  7,	'Мог-Подольс.  РЭС/ВЦПЭС'),
							array(725,  7,	'Калиновский   РЭС/ВЦПЭС'),
							array(724,  7,	'Жмеринский    РЭС/ВЦПЭС'),
							array(726,  7,	'Казатинский   РЭС/ВЦПЭС'),
							array(727,  7,	'Литинский     РЭС/ВЦПЭС'),
							array(728,  7,	'Мур-Куриловск.РЭС/ВВПЭС'),
							array(721,  7,	'Винницкий гор РЭС/ВЦПЭС'),
							array(1521,	15,	'Бершадский    РЭС/ВВПЭС'),
							array(1522,	15,	'Гайсинский    РЭС/ВВПЭС'),
							array(1523,	15,	'Ильинецкий    РЭС/ВВПЭС'),
							array(1524,	15,	'Крыжопольский РЭС/ВВПЭС'),
							array(1525,	15,	'Липовецкий    РЭС/ВВПЭС'),
							array(1526,	15,	'Немировский   РЭС/ВВПЭС'),
							array(1527,	15,	'Песчанский    РЭС/ВВПЭС'),
							array(1528,	15,	'ПогребищенскийРЭС/ВВПЭС'),
							array(1529,	15,	'Тепликский    6ЭС/ВВПЭС'),
							array(1531,	15,	'Тульчинский   РЭС/ВВПЭС'),
							array(1532,	15,	'Томашпольский РЭС/ВВПЭС'),
							array(1533,	15,	'Тростянецкий  РЭС/ВВПЭС'),
							array(1534,	15,	'Чечельникский РЭС/ВВПЭС'),
							array(1537,	15,	'Оратовский    РЭС/ВВПЭС'),
							array(1535,	15,	'Ямпольский    РЭС/ВВПЭС'));


    	foreach($RasArr as $key => $v) {
			        
			        DB::table('rems')->insert([
			            'kod_rem' => $v[0],
			            'kod_seti' => $v[1],
			            'name_rem' => $v[2],
			            'user_id' => 1,
			            'created_at' => date("Y-m-d H:i:s"),
			            'updated_at' => date("Y-m-d H:i:s")
			            
			        ]);
       	}	
    }
}
